Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateIsNotAssociatedWithGlobalParameterRule(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a filter rule that determines whether a parameter is not associated
with a certain global parameter.
parameter:
A parameter that can be associated with an existing global parameter of a compatible type.
value:
The global parameter used to test the association.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateIsAssociatedWithGlobalParameterRule(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a filter rule that determines whether a parameter is associated
with a certain global parameter.
parameter:
A parameter that can be associated with an existing global parameter of a compatible type.
value:
The global parameter used to test the association.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateNotEndsWithRule(Autodesk.Revit.DB.ElementId,System.String,System.Boolean)
Creates a filter rule that determines whether strings from the document
do not end with a certain string value.
parameter:
A string-typed parameter used to get values from the document for a given element.
value:
The user-supplied string value for which values from the document will be searched.
caseSensitive:
If true, the string comparison will be case-sensitive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateEndsWithRule(Autodesk.Revit.DB.ElementId,System.String,System.Boolean)
Creates a filter rule that determines whether strings from the document
end with a certain string value.
parameter:
A string-typed parameter used to get values from the document for a given element.
value:
The user-supplied string value for which values from the document will be searched.
caseSensitive:
If true, the string comparison will be case-sensitive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateNotBeginsWithRule(Autodesk.Revit.DB.ElementId,System.String,System.Boolean)
Creates a filter rule that determines whether strings from the document
do not begin with a certain string value.
parameter:
A string-typed parameter used to get values from the document for a given element.
value:
The user-supplied string value for which values from the document will be searched.
caseSensitive:
If true, the string comparison will be case-sensitive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateBeginsWithRule(Autodesk.Revit.DB.ElementId,System.String,System.Boolean)
Creates a filter rule that determines whether strings from the document
begin with a certain string value.
parameter:
A string-typed parameter used to get values from the document for a given element.
value:
The user-supplied string value for which values from the document will be searched.
caseSensitive:
If true, the string comparison will be case-sensitive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateNotContainsRule(Autodesk.Revit.DB.ElementId,System.String,System.Boolean)
Creates a filter rule that determines whether strings from the document do not
contain a certain string value.
parameter:
A string-typed parameter used to get values from the document for a given element.
value:
The user-supplied string value for which values from the document will be searched.
caseSensitive:
If true, the string comparison will be case-sensitive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateContainsRule(Autodesk.Revit.DB.ElementId,System.String,System.Boolean)
Creates a filter rule that determines whether strings from the document contain
a certain string value.
parameter:
A string-typed parameter used to get values from the document for a given element.
value:
The user-supplied string value for which values from the document will be searched.
caseSensitive:
If true, the string comparison will be case-sensitive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateLessOrEqualRule(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a filter rule that determines whether ElementId values
from the document are less than or equal to a certain value.
parameter:
An ElementId-typed parameter used to get values from the document for a given element.
value:
The user-supplied value against which values from the document will be compared.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateLessOrEqualRule(Autodesk.Revit.DB.ElementId,System.Int32)
Creates a filter rule that determines whether integer values
from the document are less than or equal to a certain value.
parameter:
An integer-typed parameter used to get values from the document for a given element.
value:
The user-supplied value against which values from the document will be compared.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateLessOrEqualRule(Autodesk.Revit.DB.ElementId,System.Double,System.Double)
Creates a filter rule that determines whether double-precision values
from the document are less than or equal to a certain value.
Remarks:
Values greater than the user-supplied value but within epsilon
are considered equal; therefore, such values satisfy the condition.
parameter:
A double-typed parameter used to get values from the document for a given element.
value:
The user-supplied value against which values from the document will be compared.
epsilon:
Defines the tolerance within which two values may be considered equal.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not finite
-or-
The given value for value is not a number
-or-
The given value for epsilon is not finite
-or-
The given value for epsilon is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateLessOrEqualRule(Autodesk.Revit.DB.ElementId,System.String,System.Boolean)
Creates a filter rule that determines whether strings from the document
are less than or equal to a certain value.
Remarks:
For strings, a value is "less" than another if it would appear before
the other in an alphabetically-sorted list.
parameter:
A string-typed parameter used to get values from the document for a given element.
value:
The user-supplied string value against which values from the document will be compared.
caseSensitive:
If true, the string comparison will be case-sensitive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateLessRule(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a filter rule that determines whether ElementId values
from the document are less than a certain value.
parameter:
An ElementId-typed parameter used to get values from the document for a given element.
value:
The user-supplied value against which values from the document will be compared.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateLessRule(Autodesk.Revit.DB.ElementId,System.Int32)
Creates a filter rule that determines whether integer values
from the document are less than a certain value.
parameter:
An integer-typed parameter used to get values from the document for a given element.
value:
The user-supplied value against which values from the document will be compared.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateLessRule(Autodesk.Revit.DB.ElementId,System.Double,System.Double)
Creates a filter rule that determines whether double-precision values
from the document are less than a certain value.
Remarks:
Values less than the user-supplied value but within epsilon
are considered equal, not less.
parameter:
A double-typed parameter used to get values from the document for a given element.
value:
The user-supplied value against which values from the document will be compared.
epsilon:
Defines the tolerance within which two values may be considered equal.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not finite
-or-
The given value for value is not a number
-or-
The given value for epsilon is not finite
-or-
The given value for epsilon is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateLessRule(Autodesk.Revit.DB.ElementId,System.String,System.Boolean)
Creates a filter rule that determines whether strings from the document
are less than a certain value.
Remarks:
For strings, a value is "less" than another if it would appear before
the other in an alphabetically-sorted list.
parameter:
A string-typed parameter used to get values from the document for a given element.
value:
The user-supplied string value against which values from the document will be compared.
caseSensitive:
If true, the string comparison will be case-sensitive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateGreaterOrEqualRule(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a filter rule that determines whether ElementId values
from the document are greater than or equal to a certain value.
parameter:
An ElementId-typed parameter used to get values from the document for a given element.
value:
The user-supplied value against which values from the document will be compared.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateGreaterOrEqualRule(Autodesk.Revit.DB.ElementId,System.Int32)
Creates a filter rule that determines whether integer values
from the document are greater than or equal to a certain value.
parameter:
An integer-typed parameter used to get values from the document for a given element.
value:
The user-supplied value against which values from the document will be compared.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateGreaterOrEqualRule(Autodesk.Revit.DB.ElementId,System.Double,System.Double)
Creates a filter rule that determines whether double-precision values
from the document are greater than or equal to a certain value.
Remarks:
Values less than the user-supplied value but within epsilon
are considered equal; therefore, such values satisfy the condition.
parameter:
A double-typed parameter used to get values from the document for a given element.
value:
The user-supplied value against which values from the document will be compared.
epsilon:
Defines the tolerance within which two values may be considered equal.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not finite
-or-
The given value for value is not a number
-or-
The given value for epsilon is not finite
-or-
The given value for epsilon is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateGreaterOrEqualRule(Autodesk.Revit.DB.ElementId,System.String,System.Boolean)
Creates a filter rule that determines whether strings from the document
are greater than or equal to a certain value.
Remarks:
For strings, a value is "greater" than another if it would appear after
the other in an alphabetically-sorted list.
parameter:
A string-typed parameter used to get values from the document for a given element.
value:
The user-supplied string value against which values from the document will be compared.
caseSensitive:
If true, the string comparison will be case-sensitive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateGreaterRule(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a filter rule that determines whether ElementId values
from the document are greater than a certain value.
parameter:
An ElementId-typed parameter used to get values from the document for a given element.
value:
The user-supplied value against which values from the document will be compared.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateGreaterRule(Autodesk.Revit.DB.ElementId,System.Int32)
Creates a filter rule that determines whether integer values
from the document are greater than a certain value.
parameter:
An integer-typed parameter used to get values from the document for a given element.
value:
The user-supplied value against which values from the document will be compared.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateGreaterRule(Autodesk.Revit.DB.ElementId,System.Double,System.Double)
Creates a filter rule that determines whether double-precision values
from the document are greater than a certain value.
Remarks:
Values greater than value but within epsilon
are considered equal, not greater.
parameter:
A double-typed parameter used to get values from the document for a given element.
value:
The user-supplied value against which values from the document will be compared.
epsilon:
Defines the tolerance within which two values may be considered equal.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not finite
-or-
The given value for value is not a number
-or-
The given value for epsilon is not finite
-or-
The given value for epsilon is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateGreaterRule(Autodesk.Revit.DB.ElementId,System.String,System.Boolean)
Creates a filter rule that determines whether strings from the document
are greater than a certain value.
Remarks:
For strings, a value is "greater" than another if it would appear after
the other in an alphabetically-sorted list.
parameter:
A string-typed parameter used to get values from the document for a given element.
value:
The user-supplied string value against which values from the document will be compared.
caseSensitive:
If true, the string comparison will be case-sensitive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateNotEqualsRule(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a filter rule that determines whether ElementId values
from the document do not equal a certain value.
parameter:
An ElementId-typed parameter used to get values from the document for a given element.
value:
The user-supplied value against which values from the document will be compared.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateNotEqualsRule(Autodesk.Revit.DB.ElementId,System.Int32)
Creates a filter rule that determines whether integer values
from the document do not equal a certain value.
parameter:
An integer-typed parameter used to get values from the document for a given element.
value:
The user-supplied value against which values from the document will be compared.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateNotEqualsRule(Autodesk.Revit.DB.ElementId,System.Double,System.Double)
Creates a filter rule that determines whether double-precision values
from the document do not equal a certain value.
parameter:
A double-typed parameter used to get values from the document for a given element.
value:
The user-supplied value against which values from the document will be compared.
epsilon:
Defines the tolerance within which two values may be considered equal.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not finite
-or-
The given value for value is not a number
-or-
The given value for epsilon is not finite
-or-
The given value for epsilon is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateNotEqualsRule(Autodesk.Revit.DB.ElementId,System.String,System.Boolean)
Creates a filter rule that determines whether strings from the document
do not equal a certain value.
parameter:
A string-typed parameter used to get values from the document for a given element.
value:
The user-supplied string value against which values from the document will be compared.
caseSensitive:
If true, the string comparison will be case-sensitive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateEqualsRule(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a filter rule that determines whether ElementId values
from the document equal a certain value.
parameter:
An ElementId-typed parameter used to get values from the document for a given element.
value:
The user-supplied value against which values from the document will be compared.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateEqualsRule(Autodesk.Revit.DB.ElementId,System.Int32)
Creates a filter rule that determines whether integer values
from the document equal a certain value.
parameter:
An integer-typed parameter used to get values from the document for a given element.
value:
The user-supplied value against which values from the document will be compared.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateEqualsRule(Autodesk.Revit.DB.ElementId,System.Double,System.Double)
Creates a filter rule that determines whether double-precision values
from the document equal a certain value.
parameter:
A double-typed parameter used to get values from the document for a given element.
value:
The user-supplied value against which values from the document will be compared.
epsilon:
Defines the tolerance within which two values may be considered equal.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not finite
-or-
The given value for value is not a number
-or-
The given value for epsilon is not finite
-or-
The given value for epsilon is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateEqualsRule(Autodesk.Revit.DB.ElementId,System.String,System.Boolean)
Creates a filter rule that determines whether strings from the document
equal a certain value.
parameter:
A string-typed parameter used to get values from the document for a given element.
value:
The user-supplied string value against which values from the document will be compared.
caseSensitive:
If true, the string comparison will be case-sensitive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateSharedParameterApplicableRule(System.String)
Creates a filter rule that tests elements for support of a shared parameter.
parameterName:
The name of the parameter that elements must support to satisfy this rule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ParameterFilterRuleFactory
Contains functions that create appropriate FilterRule objects based on the parameters given.
Since:
2011